{
  "_class_name": "UNet1DModel",
  "_diffusers_version": "0.30.0",
  "act_fn": null,
  "block_out_channels": [
    32,
    64,
    128
  ],
  "down_block_types": [
    "DownBlock1DNoSkip",
    "DownBlock1D",
    "AttnDownBlock1D"
  ],
  "downsample_each_block": false,
  "extra_in_channels": 16,
  "flip_sin_to_cos": true,
  "freq_shift": 0.0,
  "in_channels": 1,
  "layers_per_block": 1,
  "mid_block_type": "UNetMidBlock1D",
  "norm_num_groups": 8,
  "out_block_type": null,
  "out_channels": 1,
  "sample_rate": null,
  "sample_size": 65536,
  "time_embedding_type": "fourier",
  "up_block_types": [
    "AttnUpBlock1D",
    "UpBlock1D",
    "UpBlock1DNoSkip"
  ],
  "use_timestep_embedding": false
}
